<?php
/**
 * 插入排序
 * @authors Joker (njfupl@foxmail.com)
 * @date    2017-08-12 21:09:23
 * 假设数组的前面几位是排序好的,便利出来数组后面的每一个元素,将这个元素和前面排序好的每一个元元素进行比较,
 * 当其和所要的排序要求相反时,就将这个元素和前面的元素交换位置;
 * 我们这里从数组的第二位开始遍历,第一次拿出数组的第二个元素和第一个元素进行对比,并将它们排序好;
 * 之后要进行的就是遍历出来数组之后的元素,和他后一位进行对比
 *
 * 时间复杂度: O(n*n)
 *
 * 实现数组的升序
 */
echo "<pre>";
function insertSort($arr){
	$count=count($arr);
	for($i=1;$i<$count;$i++){
		$tem=$arr[$i];
		$j=$i-1;
		while($j>=0){
			if($arr[$j]>$tem){	
				$arr[$j+1]=$arr[$j];
				$arr[$j]=$tem;
			}
			$j--;
		}
	}	
	return  $arr;
}

$arr=[23,345,67,798,0,45,78,890,0,34,567,789,89,345,678,890,90,465,4564,6767,4353,2345,456,67,567,567,678,89,90,90,345,345,45,8789,788903,45345,52,34,4567,567,678,568,90];
var_dump(insertSort($arr));









